SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG28/Include/efr32sg28_acmp.h
/* Bit fields for ACMP IF */
#define _ACMP_IF_RESETVALUE                     0x00000000UL                            /**< Default value for ACMP_IF                   */
#define _ACMP_IF_MASK                           0x0000001FUL                            /**< Mask for ACMP_IF                            */
#define ACMP_IF_RISE                            (0x1UL << 0)                            /**< Rising Edge Triggered Interrupt Flag        */
#define _ACMP_IF_RISE_SHIFT                     0                                       /**< Shift value for ACMP_RISE                   */
#define _ACMP_IF_RISE_MASK                      0x1UL                                   /**< Bit mask for ACMP_RISE                      */
#define _ACMP_IF_RISE_DEFAULT                   0x00000000UL                            /**< Mode DEFAULT for ACMP_IF                    */
#define ACMP_IF_RISE_DEFAULT                    (_ACMP_IF_RISE_DEFAULT << 0)            /**< Shifted mode DEFAULT for ACMP_IF            */
#define ACMP_IF_FALL                            (0x1UL << 1)                            /**< Falling Edge Triggered Interrupt Flag       */
#define _ACMP_IF_FALL_SHIFT                     1                                       /**< Shift value for ACMP_FALL                   */
#define _ACMP_IF_FALL_MASK                      0x2UL                                   /**< Bit mask for ACMP_FALL                      */
#define _ACMP_IF_FALL_DEFAULT                   0x00000000UL                            /**< Mode DEFAULT for ACMP_IF                    */
#define ACMP_IF_FALL_DEFAULT                    (_ACMP_IF_FALL_DEFAULT << 1)            /**< Shifted mode DEFAULT for ACMP_IF            */
#define ACMP_IF_ACMPRDY                         (0x1UL << 2)                            /**< ACMP ready Interrupt flag                   */
#define _ACMP_IF_ACMPRDY_SHIFT                  2                                       /**< Shift value for ACMP_ACMPRDY                */
#define _ACMP_IF_ACMPRDY_MASK                   0x4UL                                   /**< Bit mask for ACMP_ACMPRDY                   */
#define _ACMP_IF_ACMPRDY_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for ACMP_IF                    */
#define ACMP_IF_ACMPRDY_DEFAULT                 (_ACMP_IF_ACMPRDY_DEFAULT << 2)         /**< Shifted mode DEFAULT for ACMP_IF            */
#define ACMP_IF_INPUTCONFLICT                   (0x1UL << 3)                            /**< Input conflict                              */
#define _ACMP_IF_INPUTCONFLICT_SHIFT            3                                       /**< Shift value for ACMP_INPUTCONFLICT          */
#define _ACMP_IF_INPUTCONFLICT_MASK             0x8UL                                   /**< Bit mask for ACMP_INPUTCONFLICT             */
#define _ACMP_IF_INPUTCONFLICT_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for ACMP_IF                    */
#define ACMP_IF_INPUTCONFLICT_DEFAULT           (_ACMP_IF_INPUTCONFLICT_DEFAULT << 3)   /**< Shifted mode DEFAULT for ACMP_IF            */
#define ACMP_IF_PORTALLOCERR                    (0x1UL << 4)                            /**< Port allocation error                       */
#define _ACMP_IF_PORTALLOCERR_SHIFT             4                                       /**< Shift value for ACMP_PORTALLOCERR           */
#define _ACMP_IF_PORTALLOCERR_MASK              0x10UL                                  /**< Bit mask for ACMP_PORTALLOCERR              */
#define _ACMP_IF_PORTALLOCERR_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for ACMP_IF                    */
#define ACMP_IF_PORTALLOCERR_DEFAULT            (_ACMP_IF_PORTALLOCERR_DEFAULT << 4)    /**< Shifted mode DEFAULT for ACMP_IF            */

/* Bit fields for ACMP IEN */
#define _ACMP_IEN_RESETVALUE                    0x00000000UL                            /**< Default value for ACMP_IEN                  */
#define _ACMP_IEN_MASK                          0x0000001FUL                            /**< Mask for ACMP_IEN                           */
#define ACMP_IEN_RISE                           (0x1UL << 0)                            /**< Rising edge interrupt enable                */
#define _ACMP_IEN_RISE_SHIFT                    0                                       /**< Shift value for ACMP_RISE                   */
#define _ACMP_IEN_RISE_MASK                     0x1UL                                   /**< Bit mask for ACMP_RISE                      */
#define _ACMP_IEN_RISE_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for ACMP_IEN                   */
#define ACMP_IEN_RISE_DEFAULT                   (_ACMP_IEN_RISE_DEFAULT << 0)           /**< Shifted mode DEFAULT for ACMP_IEN           */
#define ACMP_IEN_FALL                           (0x1UL << 1)                            /**< Falling edge interrupt enable               */
#define _ACMP_IEN_FALL_SHIFT                    1                                       /**< Shift value for ACMP_FALL                   */
#define _ACMP_IEN_FALL_MASK                     0x2UL                                   /**< Bit mask for ACMP_FALL                      */
#define _ACMP_IEN_FALL_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for ACMP_IEN                   */
#define ACMP_IEN_FALL_DEFAULT                   (_ACMP_IEN_FALL_DEFAULT << 1)           /**< Shifted mode DEFAULT for ACMP_IEN           */
#define ACMP_IEN_ACMPRDY                        (0x1UL << 2)                            /**< ACMP ready interrupt enable                 */
#define _ACMP_IEN_ACMPRDY_SHIFT                 2                                       /**< Shift value for ACMP_ACMPRDY                */
#define _ACMP_IEN_ACMPRDY_MASK                  0x4UL                                   /**< Bit mask for ACMP_ACMPRDY                   */
#define _ACMP_IEN_ACMPRDY_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for ACMP_IEN                   */
#define ACMP_IEN_ACMPRDY_DEFAULT                (_ACMP_IEN_ACMPRDY_DEFAULT << 2)        /**< Shifted mode DEFAULT for ACMP_IEN           */
#define ACMP_IEN_INPUTCONFLICT                  (0x1UL << 3)                            /**< Input conflict interrupt enable             */
#define _ACMP_IEN_INPUTCONFLICT_SHIFT           3                                       /**< Shift value for ACMP_INPUTCONFLICT          */
#define _ACMP_IEN_INPUTCONFLICT_MASK            0x8UL                                   /**< Bit mask for ACMP_INPUTCONFLICT             */
#define _ACMP_IEN_INPUTCONFLICT_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for ACMP_IEN                   */
#define ACMP_IEN_INPUTCONFLICT_DEFAULT          (_ACMP_IEN_INPUTCONFLICT_DEFAULT << 3)  /**< Shifted mode DEFAULT for ACMP_IEN           */
#define ACMP_IEN_PORTALLOCERR                   (0x1UL << 4)                            /**< Port allocation error interrupt enable      */
#define _ACMP_IEN_PORTALLOCERR_SHIFT            4                                       /**< Shift value for ACMP_PORTALLOCERR           */
#define _ACMP_IEN_PORTALLOCERR_MASK             0x10UL                                  /**< Bit mask for ACMP_PORTALLOCERR              */
#define _ACMP_IEN_PORTALLOCERR_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for ACMP_IEN                   */
#define ACMP_IEN_PORTALLOCERR_DEFAULT           (_ACMP_IEN_PORTALLOCERR_DEFAULT << 4)   /**< Shifted mode DEFAULT for ACMP_IEN           */

/* Bit fields for ACMP SYNCBUSY */
#define _ACMP_SYNCBUSY_RESETVALUE               0x00000000UL                            /**< Default value for ACMP_SYNCBUSY             */
#define _ACMP_SYNCBUSY_MASK                     0x00000001UL                            /**< Mask for ACMP_SYNCBUSY                      */
#define ACMP_SYNCBUSY_INPUTCTRL                 (0x1UL << 0)                            /**< Syncbusy for INPUTCTRL                      */
#define _ACMP_SYNCBUSY_INPUTCTRL_SHIFT          0                                       /**< Shift value for ACMP_INPUTCTRL              */
#define _ACMP_SYNCBUSY_INPUTCTRL_MASK           0x1UL                                   /**< Bit mask for ACMP_INPUTCTRL                 */
#define _ACMP_SYNCBUSY_INPUTCTRL_DEFAULT        0x00000000UL                            /**< Mode DEFAULT for ACMP_SYNCBUSY              */
#define ACMP_SYNCBUSY_INPUTCTRL_DEFAULT         (_ACMP_SYNCBUSY_INPUTCTRL_DEFAULT << 0) /**< Shifted mode DEFAULT for ACMP_SYNCBUSY      */

/** @} End of group EFR32SG28_ACMP_BitFields */
/** @} End of group EFR32SG28_ACMP */
/** @} End of group Parts */

#endif // EFR32SG28_ACMP_H
